backend/api-gateway/perf/mvp-load.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:3001' }}"
  phases:
    # MVP Load Test: 1000 concurrent users with response time < 200ms
    - duration: 30
      arrivalRate: 100
      name: initial-ramp
    - duration: 60
      arrivalRate: 100
      rampTo: 500
      name: mid-ramp
    - duration: 90
      arrivalRate: 500
      rampTo: 1000
      name: final-ramp
    - duration: 300
      arrivalRate: 1000
      name: mvp-sustain-1000-users
    - duration: 60
      arrivalRate: 1000
      rampTo: 200
      name: graceful-cooldown
  defaults:
    headers:
      Accept: application/json
      User-Agent: "MVP-LoadTest/1.0"
  # MVP Performance Requirements
  ensure:
    # Critical: Response time < 200ms for 95th percentile
    p95: 200
    # Good: Response time < 100ms for median
    p50: 100
    # Acceptable: Response time < 50ms for 90% of requests
    p90: 150
    # Maximum allowed response time
    max: 500
    # Error rate should be < 1%
    maxErrorRate: 1
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
    # Publish metrics for monitoring
    publish-metrics:
      - type: statsd
        host: localhost
        port: 8125
        prefix: "api-gateway.load-test"

scenarios:
  # Primary MVP scenario: Game catalog browsing (most common use case)
  - name: Game catalog browsing
    weight: 50
    flow:
      - get:
          url: "/api/games?limit=20"
          name: "games-list"
          expect:
            - statusCode: 200
            - hasHeader: "content-type"
      - think: 1
      - get:
          url: "/api/games/{{ $randomInt(1, 500) }}"
          name: "game-details"
          expect:
            - statusCode: [200, 404]
      - think: 2
      - get:
          url: "/api/games?category=action&limit=10"
          name: "games-filtered"
          expect:
            - statusCode: 200

  # Health monitoring (critical for MVP stability)
  - name: Health monitoring
    weight: 15
    flow:
      - get:
          url: "/health"
          name: "health-check"
          expect:
            - statusCode: 200
            - contentType: json
      - think: 10
      - get:
          url: "/health/services"
          name: "services-health"
          expect:
            - statusCode: 200

  # User authentication flow (MVP requirement)
  - name: User authentication
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          name: "user-login"
          json:
            email: "loadtest{{ $randomInt(1, 1000) }}@example.com"
            password: "testpass123"
          expect:
            - statusCode: [200, 401, 400]
      - think: 1
      # Simulate authenticated request
      - get:
          url: "/api/users/profile"
          name: "user-profile"
          headers:
            Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IkxvYWRUZXN0IiwiaWF0IjoxNTE2MjM5MDIyfQ.SflKxwRJSMeKKF2QT4fwpMeJf36POk6yJV_adQssw5c"
          expect:
            - statusCode: [200, 401, 403]

  # Mixed API operations (realistic user behavior)
  - name: Mixed operations
    weight: 10
    flow:
      - get:
          url: "/api/games?limit=5"
          name: "quick-browse"
      - think: 0.5
      - get:
          url: "/health"
          name: "health-ping"
      - think: 1
      - get:
          url: "/api/games/popular"
          name: "popular-games"
          expect:
            - statusCode: [200, 404]